src/trekker-api/app/controllers/submissions_controller.rb

INSERT INTO "submissions" ("activity_date", "converted_miles", "created_at", "flagged", "imported", "input_type", "input_value", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    submission = Submission.new(submission_params)
    submission.imported = false

    if submission.save