src/trekker-api/app/controllers/admin/sessions_controller.rb

SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."active" = $1 AND "admin_users"."username" = $2 LIMIT $3  [["active", true], ["username", "benjamin"], ["LIMIT", 1]]
INSERT INTO "admin_sessions" ("admin_user_id", "created_at", "created_from_ip", "expires_at", "token_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      username = params.dig(:username).to_s.downcase.strip
      password = params.dig(:password).to_s

      if username.blank? || password.blank?
        return render json: { error: "Username and password are required" },
                      status: :bad_request
      end

      admin = AdminUser.active.find_by(username: username)

      # authenticate() returns the record on success, false on wrong password.
      # We treat both unknown username and wrong password identically.
      unless admin&.authenticate(password)
        Rails.logger.warn("[AdminAuth] Failed login attempt for username=#{username.inspect} ip=#{request.remote_ip}")
        return render json: { error: "Invalid credentials" }, status: :unauthorized
      end

      session = admin.admin_sessions.build(created_from_ip: request.remote_ip)
      raw_token = session.generate_token
      session.save!