src/trekker-api/app/controllers/admin/submissions_controller.rb

UPDATE "submissions" SET "converted_miles" = $1, "input_type" = $2, "input_value" = $3, "updated_at" = $4 WHERE "submissions"."id" = $5  [["converted_miles", "2.0"], ["input_type", "steps"], ["input_value", "5000.0"], ["updated_at", "2026-03-19 04:45:05.375526"], ["id", 487975216]]
---
    def update
      miles_before = @submission.converted_miles

      if @submission.update(submission_update_params)

UPDATE "submissions" SET "converted_miles" = $1, "input_value" = $2, "updated_at" = $3 WHERE "submissions"."id" = $4  [["converted_miles", "20.0"], ["input_value", "20.0"], ["updated_at", "2026-03-19 04:45:20.376965"], ["id", 487975216]]
---
    def flag
      @submission.update!(flagged: !@submission.flagged)

SELECT "submissions".* FROM "submissions" WHERE "submissions"."id" = $1 LIMIT $2  [["id", 487975216], ["LIMIT", 1]]
---
    def set_submission
      @submission = Submission.find(params[:id])